[
	{
		"type": "job",
		"role": "Educator",
		"company": "Lululemon",
		"startDate": "2022",
		"endDate": "Present",
		"takeaways": "I excel in educating customers on technical products by effectively communicating their value and executing seamless transactions, leading to positive guest experiences. I am dedicated to ensuring a memorable experience.",
		"skills": [
			"Responsibility",
			"Collaboration",
			"Enthusiasm"
		],
		"specialNote": "...."
	},
	{
		"type": "job",
		"role": "Specialist",
		"company": "Apple",
		"startDate": "2019",
		"endDate": "2022",
		"takeaways": "I excel in handling ambiguity, making sound decisions, and effectively communicating technical information to a non-technical audience, resulting in a 98% customer approval rate. I have in-depth knowledge of over 50 technologies, plans, and services to provide exceptional assistance to clients.",
		"skills": [
			"Sales",
			"Technology",
			"Communication"
		],
		"specialNote": "...."
	},
	{
		"type": "job",
		"role": "Associate",
		"company": "Puma",
		"startDate": "2014",
		"endDate": "2019",
		"takeaways": "I have a proven track record in sales strategy development and implementation, setting targets and goals, and analyzing data for continuous improvement. I am committed to providing excellent customer service and am able to handle high- pressure situations in a fast-paced environment. Additionally, as head of inventory, I am responsible for maintaining a well-stocked, organized, and efficient store.",
		"skills": [
			"Planning",
			"Guiding",
			"Speaking"
		],
		"specialNote": "...."
	},
	{
		"type": "education",
		"school": "Perpetual Education",
		"subject": "Web Development",
		"major": "Design&nbsp;for&nbsp;the&nbsp;Web",
		"startDate": "2022",
		"endDate": "Present",
		"takeaways": "Web development mentorship that focuses on design, user experience, accessibility, responsiveness, problem solving, creativity, and coding. This hands- on experience allowed me to develop a well-rounded skill set, and I was able to apply my knowledge and abilities in a team environment.",
		"skills": [
			"Learning",
			"Creating",
			"Web Development"
		],
		"specialNote": "...."
	},
	{
		"type": "education",
		"school": "Cal State LA",
		"subject": "",
		"major": "Business&nbsp;Finance",
		"startDate": "2016",
		"endDate": "2020",
		"takeaways": "Obtained Bachelor's degree in Finance, where I gained a comprehensive understanding of financial markets and investments. Developed skills in financial analysis, budgeting, and risk management through hands-on experience in case studies and real-world projects. Completed coursework in accounting, economics, and statistics.",
		"skills": [
			"Business",
			"Management",
			"Excel"
		],
		"specialNote": "...."
	}
]